nateihle/AmazonHarmonyIntegration/harmony/v2_06/framework/peripheral/mcpwm/processor/mcpwm_p32mk0512mcf064.h
PLIB_INLINE_API void PLIB_MCPWM_SecondaryTimerSetup(MCPWM_MODULE_ID index, MCPWM_CLOCK_DIVIDER clock_div, uint16_t period_value)
{
     MCPWM_SecondaryTimerSetup_Default(index, clock_div, period_value);
}

PLIB_INLINE_API uint16_t PLIB_MCPWM_SecondaryTimerCountRead(MCPWM_MODULE_ID index)
{
     return MCPWM_SecondaryTimerCountRead_Default(index);
}

PLIB_INLINE_API bool PLIB_MCPWM_ExistsSecondaryTimerSetup(MCPWM_MODULE_ID index)
{
     return MCPWM_ExistsSecondaryTimerSetup_Default(index);
}

PLIB_INLINE_API void PLIB_MCPWM_ChopClockSetup(MCPWM_MODULE_ID index, uint16_t mcpwm_chop_clk_divider, MCPWM_CHOP_CLOCK_CONTROL mcpwm_chop_clk_control)
{
     MCPWM_ChopClockSetup_Default(index, mcpwm_chop_clk_divider, mcpwm_chop_clk_control);
}

PLIB_INLINE_API bool PLIB_MCPWM_ExistsChopClockSetup(MCPWM_MODULE_ID index)
{
     return MCPWM_ExistsChopClockSetup_Default(index);
}

PLIB_INLINE_API void PLIB_MCPWM_ChannelSetup(MCPWM_MODULE_ID index, MCPWM_CHANNEL_ID channel_id, MCPWM_TIME_BASE_SOURCE time_base_source, MCPWM_TIME_BASE_MODE time_base_mode, MCPWM_ALIGNMENT_MODE mcpwm_alignment_mode, MCPWM_OUTPUT_MODE mcpwm_output_mode, MCPWM_PWMxH_OUTPUT_POLARITY mcpwm_pwmh_output_polarity, MCPWM_PWMxL_OUTPUT_POLARITY mcpwm_pwml_output_polarity, MCPWM_DEADTIME_MODE mcpwm_deadtime_mode, MCPWM_DEADTIME_COMPENSATION_POLARITY mcpwm_deadtime_compensation_polarity)
{
     MCPWM_ChannelSetup_Default(index, channel_id, time_base_source, time_base_mode, mcpwm_alignment_mode, mcpwm_output_mode, mcpwm_pwmh_output_polarity, mcpwm_pwml_output_polarity, mcpwm_deadtime_mode, mcpwm_deadtime_compensation_polarity);
}

PLIB_INLINE_API bool PLIB_MCPWM_ExistsChannelSetup(MCPWM_MODULE_ID index)
{
     return MCPWM_ExistsChannelSetup_Default(index);
}

PLIB_INLINE_API void PLIB_MCPWM_ChannelPrimaryDutyCycleSet(MCPWM_MODULE_ID index, MCPWM_CHANNEL_ID channel, uint16_t value)
{
     MCPWM_ChannelPrimaryDutyCycleSet_Default(index, channel, value);
}

PLIB_INLINE_API bool PLIB_MCPWM_ExistsChannelPrimaryDutyCycleSet(MCPWM_MODULE_ID index)
{
     return MCPWM_ExistsChannelPrimaryDutyCycleSet_Default(index);
}

PLIB_INLINE_API void PLIB_MCPWM_ChannelSecondaryDutyCycleSet(MCPWM_MODULE_ID index, MCPWM_CHANNEL_ID channel, uint16_t value)
{
     MCPWM_ChannelSecondaryDutyCycleSet_Default(index, channel, value);
}

PLIB_INLINE_API bool PLIB_MCPWM_ExistsChannelSecondaryDutyCycleSet(MCPWM_MODULE_ID index)
{
     return MCPWM_ExistsChannelSecondaryDutyCycleSet_Default(index);
}

PLIB_INLINE_API void PLIB_MCPWM_ChannelPhaseSet(MCPWM_MODULE_ID index, MCPWM_CHANNEL_ID channel, uint16_t value)
{
     MCPWM_ChannelPhaseSet_Default(index, channel, value);
}

PLIB_INLINE_API bool PLIB_MCPWM_ExistsChannelPhaseSet(MCPWM_MODULE_ID index)
{
     return MCPWM_ExistsChannelPhaseSet_Default(index);
}

PLIB_INLINE_API void PLIB_MCPWM_ChannelPWMxHDeadtimeSet(MCPWM_MODULE_ID index, MCPWM_CHANNEL_ID channel, uint16_t value)
{
     MCPWM_ChannelPWMxHDeadtimeSet_Default(index, channel, value);
}

PLIB_INLINE_API void PLIB_MCPWM_ChannelPWMxLDeadtimeSet(MCPWM_MODULE_ID index, MCPWM_CHANNEL_ID channel, uint16_t value)
{
     MCPWM_ChannelPWMxLDeadtimeSet_Default(index, channel, value);
}

PLIB_INLINE_API void PLIB_MCPWM_ChannelDeadtimeCompSet(MCPWM_MODULE_ID index, MCPWM_CHANNEL_ID channel, uint16_t value)
{
     MCPWM_ChannelDeadtimeCompSet_Default(index, channel, value);
}

PLIB_INLINE_API bool PLIB_MCPWM_ExistsChannelDeadtimeSetup(MCPWM_MODULE_ID index)
{
     return MCPWM_ExistsChannelDeadtimeSetup_Default(index);
}

PLIB_INLINE_API void PLIB_MCPWM_ChannelTriggerSetup(MCPWM_MODULE_ID index, MCPWM_CHANNEL_ID channel, MCPWM_TRIGGER_DIVIDER trigger_postscaler_value, MCPWM_PRIMARY_TRIGGER_CYCLE_SELECT primary_trigger_cycle_select, MCPWM_SECONDARY_TRIGGER_CYCLE_SELECT secondary_trigger_cycle_select, MCPWM_ADC_TRIGGER_SOURCE mcpwm_adc_trigger_source, MCPWM_TRIGGER_INTERRUPT_SOURCE mcpwm_trigger_interrupt_source, uint16_t primary_trigger_compare_value, uint16_t secondary_trigger_compare_value)
{
     MCPWM_ChannelTriggerSetup_Default(index, channel, trigger_postscaler_value, primary_trigger_cycle_select, secondary_trigger_cycle_select, mcpwm_adc_trigger_source, mcpwm_trigger_interrupt_source, primary_trigger_compare_value, secondary_trigger_compare_value);
}

PLIB_INLINE_API bool PLIB_MCPWM_ChannelTriggerInterruptIsPending(MCPWM_MODULE_ID index, MCPWM_CHANNEL_ID channel)
{
     return MCPWM_ChannelTriggerInterruptIsPending_Default(index, channel);
}

PLIB_INLINE_API bool PLIB_MCPWM_ChannelTriggerInterruptIsEnabled(MCPWM_MODULE_ID index, MCPWM_CHANNEL_ID channel)
{
     return MCPWM_ChannelTriggerInterruptIsEnabled_Default(index, channel);
}

PLIB_INLINE_API void PLIB_MCPWM_ChannelTriggerInterruptFlagClear(MCPWM_MODULE_ID index, MCPWM_CHANNEL_ID channel)
{
     MCPWM_ChannelTriggerInterruptFlagClear_Default(index, channel);
}

PLIB_INLINE_API void PLIB_MCPWM_ChannelTriggerInterruptEnable(MCPWM_MODULE_ID index, MCPWM_CHANNEL_ID channel)
{
     MCPWM_ChannelTriggerInterruptEnable_Default(index, channel);
}

PLIB_INLINE_API void PLIB_MCPWM_ChannelTriggerInterruptDisable(MCPWM_MODULE_ID index, MCPWM_CHANNEL_ID channel)
{
     MCPWM_ChannelTriggerInterruptDisable_Default(index, channel);
}

PLIB_INLINE_API void PLIB_MCPWM_ChannelPrimaryTriggerCompareSet(MCPWM_MODULE_ID index, MCPWM_CHANNEL_ID channel, uint16_t trigger_compare_value)
{
     MCPWM_ChannelPrimaryTriggerCompareSet_Default(index, channel, trigger_compare_value);
}

PLIB_INLINE_API void PLIB_MCPWM_ChannelSecondaryTriggerCompareSet(MCPWM_MODULE_ID index, MCPWM_CHANNEL_ID channel, uint16_t trigger_compare_value)
{
     MCPWM_ChannelSecondaryTriggerCompareSet_Default(index, channel, trigger_compare_value);
}

PLIB_INLINE_API bool PLIB_MCPWM_ExistsChannelTrigger(MCPWM_MODULE_ID index)
{
     return MCPWM_ExistsChannelTrigger_Default(index);
}

PLIB_INLINE_API void PLIB_MCPWM_ChannelCurrentLimitSetup(MCPWM_MODULE_ID index, MCPWM_CHANNEL_ID channel, MCPWM_CURRENTLIMIT_SOURCE current_limit_source, MCPWM_CURRENTLIMIT_INPUT_POLARITY current_limit_input_polarity, MCPWM_CURRENTLIMIT_OVERRIDE_PWMxH_VALUE current_limit_override_pwmh_value, MCPWM_CURRENTLIMIT_OVERRIDE_PWMxL_VALUE current_limit_override_pwml_value, MCPWM_CURRENTLIMIT_MODE current_limit_mode)
{
     MCPWM_ChannelCurrentLimitSetup_Default(index, channel, current_limit_source, current_limit_input_polarity, current_limit_override_pwmh_value, current_limit_override_pwml_value, current_limit_mode);
}

PLIB_INLINE_API bool PLIB_MCPWM_ChannelCurrentLimitInterruptIsPending(MCPWM_MODULE_ID index, MCPWM_CHANNEL_ID channel)
{
     return MCPWM_ChannelCurrentLimitInterruptIsPending_Default(index, channel);
}

